CSI API ETABS v1
cDatabaseTables.SetOutputOptionsForDisplay Method
 Sets the database table output options for load case results.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOutputOptionsForDisplay(
	bool IsUserBaseReactionLocation,
	double UserBaseReactionX,
	double UserBaseReactionY,
	double UserBaseReactionZ,
	bool IsAllModes,
	int StartMode,
	int EndMode,
	bool IsAllBucklingModes,
	int StartBucklingMode,
	int EndBucklingMode,
	int MultistepStatic,
	int NonlinearStatic,
	int ModalHistory,
	int DirectHistory,
	int Combo
)
Function SetOutputOptionsForDisplay (
	IsUserBaseReactionLocation As Boolean,
	UserBaseReactionX As Double,
	UserBaseReactionY As Double,
	UserBaseReactionZ As Double,
	IsAllModes As Boolean,
	StartMode As Integer,
	EndMode As Integer,
	IsAllBucklingModes As Boolean,
	StartBucklingMode As Integer,
	EndBucklingMode As Integer,
	MultistepStatic As Integer,
	NonlinearStatic As Integer,
	ModalHistory As Integer,
	DirectHistory As Integer,
	Combo As Integer
) As Integer
Dim instance As cDatabaseTables
Dim IsUserBaseReactionLocation As Boolean
Dim UserBaseReactionX As Double
Dim UserBaseReactionY As Double
Dim UserBaseReactionZ As Double
Dim IsAllModes As Boolean
Dim StartMode As Integer
Dim EndMode As Integer
Dim IsAllBucklingModes As Boolean
Dim StartBucklingMode As Integer
Dim EndBucklingMode As Integer
Dim MultistepStatic As Integer
Dim NonlinearStatic As Integer
Dim ModalHistory As Integer
Dim DirectHistory As Integer
Dim Combo As Integer
Dim returnValue As Integer
returnValue = instance.SetOutputOptionsForDisplay(IsUserBaseReactionLocation,
	UserBaseReactionX, UserBaseReactionY,
	UserBaseReactionZ, IsAllModes, StartMode,
	EndMode, IsAllBucklingModes, StartBucklingMode,
	EndBucklingMode, MultistepStatic,
	NonlinearStatic, ModalHistory, DirectHistory,
	Combo)
int SetOutputOptionsForDisplay(
	bool IsUserBaseReactionLocation,
	double UserBaseReactionX,
	double UserBaseReactionY,
	double UserBaseReactionZ,
	bool IsAllModes,
	int StartMode,
	int EndMode,
	bool IsAllBucklingModes,
	int StartBucklingMode,
	int EndBucklingMode,
	int MultistepStatic,
	int NonlinearStatic,
	int ModalHistory,
	int DirectHistory,
	int Combo
)
abstract SetOutputOptionsForDisplay :
        IsUserBaseReactionLocation : bool *
        UserBaseReactionX : float *
        UserBaseReactionY : float *
        UserBaseReactionZ : float *
        IsAllModes : bool *
        StartMode : int *
        EndMode : int *
        IsAllBucklingModes : bool *
        StartBucklingMode : int *
        EndBucklingMode : int *
        MultistepStatic : int *
        NonlinearStatic : int *
        ModalHistory : int *
        DirectHistory : int *
        Combo : int -> int
Parameters
IsUserBaseReactionLocation
Type: System.Boolean
Input Item: Indicates if the base reaction location is user specified instead of program determined.
UserBaseReactionX
Type: System.Double
Input Item: The global X coordinate of the user specified base reaction location. This item only applies when the IsUserBaseReactionLocation item is True.
UserBaseReactionY
Type: System.Double
Input Item: The global Y coordinate of the user specified base reaction location. This item only applies when the IsUserBaseReactionLocation item is True.
UserBaseReactionZ
Type: System.Double
Input Item: The global Z coordinate of the user specified base reaction location. This item only applies when the IsUserBaseReactionLocation item is True.
IsAllModes
Type: System.Boolean
Input Item: Indicates if results are to be displayed for all modes of modal load cases.
StartMode
Type: System.Int32
Input Item: The first mode for which results are shown for modal load cases. This item only applies when the IsAllModes item is False.
EndMode
Type: System.Int32
Input Item: The last mode for which results are shown for modal load cases. This item only applies when the IsAllModes item is False.
IsAllBucklingModes
Type: System.Boolean
Input Item: Indicates if results are to be displayed for all modes of buckling load cases.
StartBucklingMode
Type: System.Int32
Input Item: The first mode for which results are shown for buckling load cases. This item only applies when the IsAllBucklingModes item is False.
EndBucklingMode
Type: System.Int32
Input Item: The last mode for which results are shown for buckling load cases. This item only applies when the IsAllBucklingModes item is False.
MultistepStatic
Type: System.Int32
Input Item: Indicates how multistep static load case results are displayed: 1=Envelopes, 2=Step-by-step, 3=Last Step.
NonlinearStatic
Type: System.Int32
Input Item: Indicates how nonlinear static load case results are displayed: 1=Envelopes, 2=Step-by-step, 3=Last Step.
ModalHistory
Type: System.Int32
Input Item: Indicates how multistep modal time history load case results are displayed: 1=Envelopes, 2=Step-by-step, 3=Last Step.
DirectHistory
Type: System.Int32
Input Item: Indicates how direct integration time load case results are displayed: 1=Envelopes, 2=Step-by-step, 3=Last Step.
Combo
Type: System.Int32
Returned Item: Indicates how load combination results are displayed: 1=Envelopes, 2=Multiple Values If Possible.
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace